In [9]:
# 10.1 Data Aggregation and Group Operations

#  GroupBy Mechanics
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],\
               'key2' : ['one', 'two', 'one', 'two', 'one'],\
              'data1' : np.random.randn(5),\
             'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.311119 -0.105000
1    a  two -0.877501  0.344271
2    b  one  0.487125  1.389191
3    b  two  0.146557 -1.341356
4    a  one -1.185069 -1.409478

In [10]:
#  to access data1 and call groupby with the column (a Series) at key1
grouped = df['data1'].groupby(df['key1'])
grouped

In [11]:
grouped.mean()

key1
a   -0.791230
b    0.316841
Name: data1, dtype: float64

In [12]:
grouped1 = df['data1'].groupby(df['key2'])
grouped1.mean()

key2
one   -0.336355
two   -0.365472
Name: data1, dtype: float64

In [13]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one    -0.748094
      two    -0.877501
b     one     0.487125
      two     0.146557
Name: data1, dtype: float64

In [14]:
# grouped the data using two keys, and the resulting Series now has a hier‚Äê
# archical index consisting of the unique pairs of keys observed
means.unstack()

key2       one       two
key1
a    -0.748094 -0.877501
b     0.487125  0.146557

In [15]:
# the group keys are all Series, though they could be any arrays of the right length
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005   -0.877501
            2006    0.487125
Ohio        2005   -0.082281
            2006   -1.185069
Name: data1, dtype: float64

In [16]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.791230 -0.390069
b     0.316841  0.023918

In [17]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.748094 -0.757239
     two  -0.877501  0.344271
b    one   0.487125  1.389191
     two   0.146557 -1.341356

In [18]:
# a generally useful GroupBy method is size, which returns a Series containing group sizes
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [21]:
# Iterating Over Groups

for name, group in df.groupby('key1'):
        print(name)
        print(group)
        print()
print(df)

a
  key1 key2     data1     data2
0    a  one -0.311119 -0.105000
1    a  two -0.877501  0.344271
4    a  one -1.185069 -1.409478

b
  key1 key2     data1     data2
2    b  one  0.487125  1.389191
3    b  two  0.146557 -1.341356

  key1 key2     data1     data2
0    a  one -0.311119 -0.105000
1    a  two -0.877501  0.344271
2    b  one  0.487125  1.389191
3    b  two  0.146557 -1.341356
4    a  one -1.185069 -1.409478

In [23]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
        print((k1, k2))
        print()
        print(group)

('a', 'one')

  key1 key2     data1     data2
0    a  one -0.311119 -0.105000
4    a  one -1.185069 -1.409478
('a', 'two')

  key1 key2     data1     data2
1    a  two -0.877501  0.344271
('b', 'one')

  key1 key2     data1     data2
2    b  one  0.487125  1.389191
('b', 'two')

  key1 key2     data1     data2
3    b  two  0.146557 -1.341356

In [24]:
# A recipe you may find useful is computing a dict of the data pieces as a one-liner
pieces = dict(list(df.groupby('key1')))
pieces['b']

  key1 key2     data1     data2
2    b  one  0.487125  1.389191
3    b  two  0.146557 -1.341356

In [25]:
pieces['a']

  key1 key2     data1     data2
0    a  one -0.311119 -0.105000
1    a  two -0.877501  0.344271
4    a  one -1.185069 -1.409478

In [27]:
print(df, '\n')
df.dtypes

  key1 key2     data1     data2
0    a  one -0.311119 -0.105000
1    a  two -0.877501  0.344271
2    b  one  0.487125  1.389191
3    b  two  0.146557 -1.341356
4    a  one -1.185069 -1.409478

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [28]:
grouped = df.groupby(df.dtypes, axis=1)
grouped

In [30]:
for dtype, group in grouped:
        print(dtype, '\n')
        print(group)

float64

      data1     data2
0 -0.311119 -0.105000
1 -0.877501  0.344271
2  0.487125  1.389191
3  0.146557 -1.341356
4 -1.185069 -1.409478
object

  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [31]:
# Selecting a Column or Subset of Columns

df.groupby('key1')['data1']
df.groupby('key1')[['data2']]
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.757239
     two   0.344271
b    one   1.389191
     two  -1.341356

In [32]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [33]:
s_grouped.mean()

key1  key2
a     one    -0.757239
      two     0.344271
b     one     1.389191
      two    -1.341356
Name: data2, dtype: float64

In [36]:
# Grouping with Dicts and Series

people = pd.DataFrame(np.random.randn(5, 5),\
columns=['a', 'b', 'c', 'd', 'e'],\
index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.iloc[2:3, [1, 2]] = np.nan         # Add a few NA values
people

               a         b         c         d         e
Joe     1.353604 -1.210208 -0.426073 -0.002299 -0.625013
Steve   0.237052  0.474897  1.087004  0.877126  0.677611
Wes    -0.053469       NaN       NaN  1.227146 -1.135325
Jim    -0.360252  0.200590  0.280177  0.192899 -1.235385
Travis  1.566733  0.832110  2.435505  0.111632 -2.287885

In [37]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',\
 'd': 'blue', 'e': 'red', 'f' : 'orange'}
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe    -0.428371 -0.481618
Steve   1.964130  1.389560
Wes     1.227146 -1.188794
Jim     0.473076 -1.395046
Travis  2.547138  0.110958

In [38]:
#  same functionality holds for Series, which can be viewed as a fixed-size mapping
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [39]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [40]:
# Grouping with Functions

people.groupby(len).sum()

          a         b         c         d         e
3  0.939883 -1.009618 -0.145895  1.417747 -2.995723
5  0.237052  0.474897  1.087004  0.877126  0.677611
6  1.566733  0.832110  2.435505  0.111632 -2.287885

In [42]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.053469 -1.210208 -0.426073 -0.002299 -1.135325
  two -0.360252  0.200590  0.280177  0.192899 -1.235385
5 one  0.237052  0.474897  1.087004  0.877126  0.677611
6 two  1.566733  0.832110  2.435505  0.111632 -2.287885

In [45]:
# Grouping by Index Levels

columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],\
 [1, 3, 5, 1, 3]],\
 names=['cty', 'tenor'])
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.288521  0.947171  0.054270 -0.792665  0.719305
1      0.280623  0.186707  0.562518  1.499135  1.479105
2     -0.356759 -0.471191  0.030722  0.034044  0.552702
3     -1.772647  0.131017  0.303803  1.282872  0.822486

In [46]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [47]:
# 10.2 Data Aggregation

df

  key1 key2     data1     data2
0    a  one -0.311119 -0.105000
1    a  two -0.877501  0.344271
2    b  one  0.487125  1.389191
3    b  two  0.146557 -1.341356
4    a  one -1.185069 -1.409478

In [48]:
# GroupBy efficiently slices up the Series, calls piece.quantile(0.9) for each piece,
# and then assembles those results together into the result object

grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a   -0.424396
b    0.453068
Name: data1, dtype: float64

In [49]:
def peak_to_peak(arr):
        return arr.max() - arr.min()

grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.873949  1.753749
b     0.340568  2.730546

In [50]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.791230  0.443316 -1.185069 -1.031285 -0.877501 -0.594310
b      2.0  0.316841  0.240818  0.146557  0.231699  0.316841  0.401983

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a    -0.311119   3.0 -0.390069  0.910965 -1.409478 -0.757239 -0.105000
b     0.487125   2.0  0.023918  1.930788 -1.341356 -0.658719  0.023918


           75%       max
key1
a     0.119636  0.344271
b     0.706554  1.389191

In [ ]:
# Column-Wise and Multiple Function Application

tips = pd.read_csv(r'D:/Fajun/home/Practice/tips.csv')
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips[:6]

In [53]:
# 10.3 Apply: General split-apply-combine

def top(df, n=5, column='tip_pct'):
        return df.sort_values(by=column)[-n:]
top(tips, n=6)

   total_bill   tip  smoker  day    time   size    tip_pct
0        16.99  1.01     No   Sun  Dinner      2  0.059447
3        23.68  3.31     No   Sun  Dinner      2  0.139780
4        24.59  3.61     No   Sun  Dinner      4  0.146808
1        10.34  1.66     No   Sun  Dinner      3  0.160542
2        21.01  3.50     No   Sun  Dinner      3  0.166587
5        25.29  4.71     No   Sun  Dinner      4  0.186240

In [ ]:
# tips = top(tips, n=6)
tips.groupby('smoker').apply(top)

In [58]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
....: 'data2': np.random.randn(1000)})
quartiles = pd.cut(frame.data1, 4)
quartiles[:10]

0     (-1.384, 0.202]
1      (0.202, 1.788]
2      (0.202, 1.788]
3    (-2.977, -1.384]
4      (0.202, 1.788]
5      (0.202, 1.788]
6     (-1.384, 0.202]
7     (-1.384, 0.202]
8      (0.202, 1.788]
9     (-1.384, 0.202]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-2.977, -1.384] < (-1.384, 0.202] < (0.202, 1.788] < (1.788, 3.374]]

In [60]:
# Quantile and Bucket Analysis

def get_stats(group):
        return {'min': group.min(), 'max': group.max(), 'count': group.count(), 'mean': group.mean()}
grouped = frame.data2.groupby(quartiles)
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-2.977, -1.384]   92.0  2.196106  0.067764 -2.030244
(-1.384, 0.202]   526.0  2.842376 -0.013122 -3.091117
(0.202, 1.788]    346.0  3.196003 -0.089433 -3.078432
(1.788, 3.374]     36.0  2.247216  0.129295 -2.338194

In [61]:
grouping = pd.qcut(frame.data1, 10, labels=False)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.196106  0.092435 -2.030244
1      100.0  2.681791  0.164402 -2.481011
2      100.0  2.388449  0.079480 -2.608790
3      100.0  2.381065 -0.124905 -3.091117
4      100.0  2.842376 -0.152160 -2.796141
5      100.0  2.463838 -0.030185 -2.673154
6      100.0  3.196003 -0.108211 -2.368246
7      100.0  2.684818 -0.010220 -3.028472
8      100.0  2.248234 -0.144591 -2.692219
9      100.0  2.707988 -0.035615 -3.078432

In [63]:
# Filling Missing Values with Group-Specifc Values

s = pd.Series(np.random.randn(6))
s[::2] = np.nan
s

0         NaN
1    1.323547
2         NaN
3   -0.736612
4         NaN
5    1.460900
dtype: float64

In [64]:
s.fillna(s.mean())

0    0.682612
1    1.323547
2    0.682612
3   -0.736612
4    0.682612
5    1.460900
dtype: float64

In [65]:
states = ['Ohio', 'New York', 'Vermont', 'Florida','Oregon', 'Nevada', 'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = pd.Series(np.random.randn(8), index=states)
data

Ohio         -0.015488
New York      0.106513
Vermont      -0.886291
Florida      -0.354472
Oregon        0.217780
Nevada        0.656594
California   -0.391125
Idaho         1.052792
dtype: float64

In [66]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio         -0.015488
New York      0.106513
Vermont            NaN
Florida      -0.354472
Oregon        0.217780
Nevada             NaN
California   -0.391125
Idaho              NaN
dtype: float64

In [67]:
data.groupby(group_key).mean()

East   -0.087816
West   -0.086672
dtype: float64

In [68]:
fill_mean = lambda g: g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

Ohio         -0.015488
New York      0.106513
Vermont      -0.087816
Florida      -0.354472
Oregon        0.217780
Nevada       -0.086672
California   -0.391125
Idaho        -0.086672
dtype: float64

In [69]:
fill_values = {'East': 0.5, 'West': -1}
fill_func = lambda g: g.fillna(fill_values[g.name])
data.groupby(group_key).apply(fill_func)

Ohio         -0.015488
New York      0.106513
Vermont       0.500000
Florida      -0.354472
Oregon        0.217780
Nevada       -1.000000
California   -0.391125
Idaho        -1.000000
dtype: float64

In [71]:
# Random Sampling and Permutation

suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
        cards.extend(str(num) + suit for num in base_names)
        
deck = pd.Series(card_val, index=cards)
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [72]:
def draw(deck, n=5):
        return deck.sample(n)
draw(deck)

2C      2
7D      7
10D    10
10S    10
10H    10
dtype: int64

In [73]:
get_suit = lambda card: card[-1] # last letter is suit
deck.groupby(get_suit).apply(draw, n=2)

C  9C     9
   AC     1
D  AD     1
   7D     7
H  AH     1
   9H     9
S  9S     9
   KS    10
dtype: int64

In [74]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

3C     3
KC    10
2D     2
4D     4
9H     9
7H     7
4S     4
QS    10
dtype: int64

In [76]:
#„ÄÄ„ÄÄGroup Weighted Average and Correlation

df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',\
 'b', 'b', 'b', 'b'],\
 'data': np.random.randn(8),\
 'weights': np.random.rand(8)})
df

  category      data   weights
0        a -0.022913  0.164152
1        a -0.578829  0.311328
2        a -0.687872  0.818838
3        a -1.044828  0.367899
4        b -0.522955  0.019078
5        b -0.625849  0.519865
6        b  0.386498  0.112527
7        b  0.353893  0.108905

In [77]:
grouped = df.groupby('category')
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])
grouped.apply(get_wavg)

category
a   -0.680786
b   -0.333127
dtype: float64

In [ ]:
# Group-Wise Linear Regression

#  the following regress function (using the statsmodels econometrics library), which executes an ordinary least
# squares (OLS) regression on each chunk of data import statsmodels.api as sm
def regress(data, yvar, xvars):
        Y = data[yvar]
        X = data[xvars]
        X['intercept'] = 1.
        result = sm.OLS(Y, X).fit()
        return result.params
rets = close_px.pct_change().dropna()
get_year = lambda x: x.year
by_year = rets.groupby(get_year)
by_year.apply(regress, 'AAPL', ['SPX'])

In [ ]:
# 10.4 Pivot Tables and Cross-Tabulation

tips.pivot_table(index=['day', 'smoker'])